InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили/Ext/RecordSetModule.bsl
// Семенихин 05.11.2024 +++++
Процедура ПередЗаписью(Отказ, Замещение)
	// проверка для предотвращения попытки полной очистки регистра
	Если ЭтотОбъект.Количество() = 0 Тогда
		Если ОбЗначениеНеЗаполнено(ЭтотОбъект.Отбор.Автомобиль.Значение) И
			ОбЗначениеНеЗаполнено(ЭтотОбъект.Отбор.ВидЗначения.Значение) Тогда
			СтрокаОтказа = "ВНИМАНИЕ! Отменена попытка полной очистки регистра!";
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ОбЗначениеНеЗаполнено(Запись.Автомобиль) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено поле ""Автомобиль"". Запись Характеристики автомобиля невозможна!";
			Прервать;
		КонецЕсли; 
		
		Если Запись.Автомобиль.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать группу в качестве объекта Характеристики автомобилей.";
			Прервать;
		КонецЕсли;
		
		Если ОбЗначениеНеЗаполнено(Запись.ВидЗначения) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено поле ""ВидЗначения"". Запись Характеристики автомобиля невозможна!";
			Прервать;
		КонецЕсли;
		
		Если ОбЗначениеНеЗаполнено(Запись.Значение) И ТипЗнч(Запись.Значение) <> Тип("Булево") И ТипЗнч(Запись.Значение) <> Тип("Число") Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено значение Характеристики автомобиля " + Строка(Запись.ВидЗначения) + ". Запись невозможна!";
			Прервать;
		КонецЕсли;
		
		Запись.КтоВнес = ПараметрыСеанса.Пользователь;
		Запись.КогдаВнес = ТекущаяДата();
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли; 
КонецПроцедуры
// Семенихин 05.11.2024 -----
